export const رسم_صفحة_قرآن = 
`دل بدء (معرف_منطقة_العرض) {
    صفحة_قرآن() 
        |> عرض_اولي (معرف_منطقة_العرض) 
}

دل صفحة_قرآن {
  صفحة_الشبكة {
    راس {
        نسق {
            عرف_خط(
                فصيلة_الخط     : حاشية.حفص_عثماني                                 
                مصدر           :  عنوان(حاشية.عنوان_خط_حفص_عثماني_نسخة٢٢)  
            )

            اختر(
                عنصر           : [«صفحة_الشبكة» ، «متن»]
                بطانة          : ٠ع_ص
                هامش           : ٠ع_ص
            )
            اختر(
                عنصر           : «صفحة_الشبكة»
                اظهار          : مرن
                ضبط_المحتوى    : مركز
                محاذاة_العناصر : مركز
            )
            اختر(
                عنصر           : «متن»                
                عرض            : ٤٨٠ع_ص
                ارتفاع         : ٦٤٠ع_ص
                اظهار          : مرن
                ضبط_العناصر    : مركز
                محاذاة_العناصر : مركز
            ) 
            
            اختر(
                عنصر               : «#اطار»
                اظهار              : مرن
                عرض                : ٤٨٠ع_ص
                ارتفاع             : ٦٤٠ع_ص               
                ادنى_عرض           : ٤٨٠ع_ص
                ادنى_ارتفاع        : ٦٤٠ع_ص
                فائض               : قطع
                مرن_باتجاه         : عمودي
                محاذاة_العناصر     : مركز

                صورة_الخلفية       : عنوان(حاشية.اطار_صفحة_القرآن)
                موقع_الخلفية       : مركز
                تكرار_الخلفية      : لا_تكرار
                حجم_الخلفية        : احتواء
                نسبة_س_ص           : تلقائي
            )

            اختر(
                عنصر           : «#محتوى»
                هامش_علوي      : ٦٠ع_ص
                ارتفاع         : ٥٥٠ع_ص
                عرض            : ٣٣٠ع_ص
                فائض           : قطع
                اظهار          : مرن
                مرن_باتجاه     : عمودي
                فجوة           : ١م_ج

            )

            اختر(
                عنصر           : «.سورة»
                عرض            : ٣٣٠ع_ص                
                اظهار          : مرن
                مرن_باتجاه     : عمودي
                محاذاة_العناصر : مركز

            )

            اختر(
                عنصر           : «.راس_السورة»
                هامش           : ٠ع_ص
                عرض            : ٣٢٠ع_ص
                محاذاة_النص    : مركز
                نسق_الحدود     : ضعف
            )

            اختر(
                عنصر           : «.آيات»
                عرض            : ٣٣٠ع_ص
                فصيلة_الخط     : حاشية.حفص_عثماني 
                حجم_الخط       : ٢٠ع_ص
                حدود_خارجية    : بلا_قيمة
                حدود           : بلا_قيمة
                خلفية          : بلا_قيمة 
                اعادة_تحجيم    : بلا_قيمة 

                محاذاة_النص    : ضبط
                ضبط_النص       : بين_الكلمات
                فائض           : قطع 

                شريط_التمرير_عرض        : بلا_قيمة                  

                خيال_الصندوق            : بلا_قيمة                        
                _آبل_خيال_الصندوق       : بلا_قيمة
                _موزيلا_خيال_الصندوق     : بلا_قيمة
    
                قدرة_اختيار_النص        : بلا_قيمة
                _موزيلا_قدرة_اختيار_النص : بلا_قيمة
                _آبل_قدرة_اختيار_النص   : بلا_قيمة
                
            )

        }
    }
    متن {
        قسم(«اطار») { 
          قسم(«محتوى») {
            قسم( صنف : «سورة» ) {
                 عنوان_راسي٣( صنف : «راس_السورة» ) { «سورة الاخلاص»}
                منطقة_النص( 
                    صنف         : «آيات» 
                    اعمدة       : ٣٠ 
                    صفوف        : ٣
                    للقراءة_فقط : صحيح
                ) { 
                    «                    بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ٪(س)» 
                    «قُلْ هُوَ اللَّهُ أَحَدٌ١اللَّهُ الصَّمَدُ٢لَمْ يَلِدْ وَلَمْ يُولَدْ٣وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ٤»
                }
            }
            قسم( صنف : «سورة» ) {
                 عنوان_راسي٣( صنف : «راس_السورة» ) { «سورة الفلق»}
                منطقة_النص( 
                    صنف         : «آيات» 
                    اعمدة       : ٣٠ 
                    صفوف        : ٤
                    للقراءة_فقط : صحيح
                ) { 
                    «                    بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ٪(س)» 
                    «قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ١مِنْ شَرِّ مَا خَلَقَ٢وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ٣وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ٤وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ٥» }
            }
            قسم( صنف : «سورة» ) {
                عنوان_راسي٣( صنف : «راس_السورة» ) { «سورة الناس» }
                منطقة_النص( 
                    صنف         : «آيات» 
                    اعمدة       : ٣٠ 
                    صفوف        : ٤
                    للقراءة_فقط : صحيح
                ) { 
                    «                    بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ٪(س)» 
                    «قُلْ أَعُوذُ بِرَبِّ النَّاسِ١مَلِكِ النَّاسِ٢إِلَهِ النَّاسِ٣مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ٤الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ٥مِنَ الْجِنَّةِ وَالنَّاسِ٦»
             }
           }
         } 
       }
    }
  }
}

ثابت حاشية = (
      حفص_عثماني                 : «UthmanicHafs» 
      عنوان_خط_حفص_عثماني_نسخة٢٢ : «https://raw.githubusercontent.com/abukhadra/quran-sn/9e0ee248c4a659fd097f01a90577b85c1cbd2fbf/font/UthmanicHafs_V22.ttf» 
      اطار_صفحة_القرآن           : «https://raw.githubusercontent.com/abukhadra/quran-sn/9e0ee248c4a659fd097f01a90577b85c1cbd2fbf/image/quran_frame.png»
)`