export const تعاقب_الليل_والنهار=`استخدم صفحة_الشبكة

[+] بدء منطقة = 
	صفحة => 
		اظهار(منطقة)

:: (صفحة_شبكة) 
[+] صفحة =
    جذر => 
        راس => 
            تنسيق => 
                انتقاء( وسم(متن) , وسم(جذر) ) => 
                    هامش            : 0 
                    بطانة           : 0 

                انتقاء( وسم(«*») ) => 
                    تحجيم_الصندوق        : حدود_الصندوق 
                
                انتقاء( متن ) => 
                    ارتفاع           : 100ع_ط  {- ع_ط : عرض مرأى مقطعي -}
                    لون_الخلفية      : بلا_قيمة
                    اظهار            : مرن
                    ضبط_المحتوى      : مركز
                    محاذاة_العناصر   : مركز 

                انتقاء( معرف(سماء) ) => 
                   عرض              : 11م_ج {- م_ج : مقياس الجذر -}
                   اظهار            : مرن
                   ضبط_المحتوى      : بداية
                   فجوة             : 3م_ج
                   حدود             : (0.1م_ج ، بارز)
                   بطانة            : 0.3م_ج
                   قطر_الحدود       : 2م_ج
                   لون_الخلفية      : سماوي_فاتح

                انتقاء( معرف(«حالة_اليوم») ) => 
                   _آبل_قدرة_اختيار_النص           : بلا_قيمة
                   _مايكروسوفت_قدرة_اختيار_النص    : بلا_قيمة
                   قدرة_اختيار_النص                : بلا_قيمة
                   موضع                            : مطلق
                   اظهار                           : مرن  
                   ضبط_المحتوى                     : مسافة_بين
                   هامش                            : 0.8م_ج
                   عرض                             : 9م_ج

                انتقاء( معرف(«ليل») )  => 
                   لون             : سماوي_فاتح

                انتقاء( صنف(«مركز») ) => 
                   ضبط_المحتوى     : مركز
                   محاذاة_العناصر  : مركز
 

                انتقاء( صنف(«دائرة») ) => 
                   عرض             : 3م_ج
                   ارتفاع          : 3م_ج
                   قطر_الحدود      : 3م_ج

                انتقاء( معرف(«دائرة_خارجية») ) => 
                   فائض            : مخفي
                   لون_الخلفية     : اصفر
                   عتامة           : 58٪

                انتقاء( معرف(«دائرة_داخلية») ) => 
                   عرض             : 0
                   ارتفاع          : 0
                   هامش_ايمن       : -0.7م_ج
                   هامش_سفلي       : -0.4م_ج
                   لون_الخلفية     : اسود

                انتقاء( معرف(«سماء») ) =>
                   تحريك           : (ضوء، 7ث ، لا_نهاية)

                انتقاء(
                     معرف( «سماء» )
                         .معرف( «دائرة_خارجية» ) 
                ) => 
                   تحريك           : (غروب_الشمس، 7ث ، لا_نهاية)

                انتقاء(
                    معرف(«سماء»)
                        .معرف(«حالة_اليوم»)
                            .معرف(«ليل»)
                ) =>
                   تحريك           : (ليل، 7ث ، لا_نهاية)

                انتقاء(
                    معرف(«سماء»)
                        .معرف(«دائرة_خارجية»)
                            .معرف(«دائرة_داخلية») 
                ) => 
                    تحريك : ( «بزوغ_القمر», 7s, لا_نهاية )

                اطارات_رئيسية(«ليل») =>    
                   عند(0٪     ، ( لون: سماوي_فاتح ) )
                   عند(50٪    ، ( لون: ابيض       ) )
                   عند(100٪   ، ( لون: سماوي_فاتح ) )

                اطارات_رئيسية(«ضوء») =>
                      عند(0٪)   => لون_الخلفية : سماوي_فاتح 
                      عند(10٪)  => لون_الخلفية : سماوي_فاتح 
                      عند(30٪)  => لون_الخلفية : اسود        
                      عند(50٪)  => لون_الخلفية : اسود        
                      عند(60٪)  => لون_الخلفية : اسود        
                      عند(70٪)  => لون_الخلفية : سماوي_فاتح 
                      عند(100٪) => لون_الخلفية : سماوي_فاتح 

                اطارات_رئيسية(«بزوغ_القمر») => 
                    عند(0٪)     => ارتفاع( 0 )    ; عرض( 0 )    ; لون_الخلفية( سماوي_فاتح ) 
                    عند(50٪)    => ارتفاع( 3rem ) ; عرض( 3rem ) ; لون_الخلفية( اسود )        
                    عند(100٪)   => ارتفاع( 0 )    ; عرض( 0 )    ; لون_الخلفية( سماوي_فاتح )                

                اطارات_رئيسية(«غروب_الشمس») => 
                     عند(0٪)   => تحول        : ازاحة_س( 0٪ )   
                     عند(10٪)  => لون_الخلفية : اصفر              
                     عند(20٪)  => لون_الخلفية : برتقالي              
                     عند(30٪)  => لون_الخلفية : اصفر              
                     عند(50٪)  => تحول        : ازاحة_س( -235٪ ) 
                     عند(60٪)  => لون_الخلفية : اصفر              
                     عند(70٪)  => لون_الخلفية : برتقالي              
                     عند(80٪)  => لون_الخلفية : اصفر              
                     عند(100٪) => تحول        : ازاحة_س( 0٪ ) 
                 --
            --
        --
        متن => 
            قسم => 
                قسم(«سماء») => 
                    قسم(«حالة_اليوم») => 
                        قسم(«نهار»)    => .نص( «صباح الخير»   ) 
                        قسم(«ليل»)  => .نص( «مساء الخير» ) 
                    --
                    قسم(«دائرة_خارجية») =>  
                        صنف«دائرة»)
                        صنف«مركز»)
                        قسم(«دائرة_داخلية») => .صنف«دائرة»)
                    --
                --
            --
        --
    --
--

نوع وسم                        :  جذر | متن | راس 
نوع AlignItems                     : center 
نوع AnimationIterationCount        : لا_نهاية 
نوع Borderتنسيق                    : ridge 
نوع لون                          : سماوي_فاتح | اصفر | اسود 
نوع Dispaly                        : flex 
نوع JustifyContent                 : center | end | space_between 
نوع Overflow                       : hidden 
نوع Position                       : absolute 
نوع Rule                           : انتقاء(_) | KeyFrame(_) 

نوع صفحة_الشبكة   (                                 )
نوع جذر      ( _راس : راس  , _متن : متن    ) 
نوع راس      ( تنسيقات : [تنسيق]                )
نوع تنسيق     ( قواعد : [ Rule ]                )  
نوع محدد  ( قيمة: سلسلة                          ) 
نوع تحريك ( 
    اسم                        : سلسلة
    مدة_التحريك          : عدد{ث}
    تعداد_اعادة_التحريك   : تعداد_اعادة_التحريك
)

نوع Border (
    border_عرض: عدد 
    border_style: Borderتنسيق 
)

نوع انتقاء             ( محددين : [ محدد ] , خصائص : ...خصائص               )
نوع زيحان_الاطار_الرئيسي  ( زيحان : عدد      , خصائص : ...خصائص               )
نوع اطار_الرئيسي           ( id : سلسلة        , زيحان : [زيحان_الاطار_الرئيسي]          ) 
نوع متن                ( els: [عنصر_صفحة]                                        ) 
نوع نص                 ( v: سلسلة                                                )
نوع قسم                ( معرف: سلسلة , اصناف : [سلسلة] , ابناء: [عنصر_صفحة]   )

نوع خصائص (
    align_items        : AlignItems? 
    animation          : AnimationIterationCount?
    لون_الخلفية        : لون? 
    border             : Border?
    border_radius      : عدد 
    لون              : لون?
    display            : Display?
    gap                : عدد  
    ارتفاع             : عدد 
    justify_content    : JustifyContent 
    هامش             : عدد 
    هامش_ايمن       : عدد 
    هامش_علوي         : عدد 
    هامش_سفلي         : عدد 
    ms_user_select     : none              -- IE 10 and IE 11
    opacity            : عدد 
    overflow           : Overflow 
    padding            : عدد
    position           : Position 
    user_select        : none  
    webkit_user_select : none              -- Safari 
    عرض              : عدد 
)

:: (صفحة_الشبكة) سلسلة -> محدد
[+] معرف س = محدد( «#» ++ س )  

:: (صفحة_الشبكة) سلسلة -> محدد
[+] صنف س = محدد( «.» ++ س )   

:: (صفحة_الشبكة) سلسلة -> محدد
[+] وسم س = محدد( س )    

:: (صفحة_الشبكة) -> جذر
[+] جذر = جذر

:: (صفحة_الشبكة) -> راس
[+] راس = 
	_راس = راس
	_راس 

:: (جذر) -> متن
متن = 
	_متن = متن
	_متن 


:: (راس) -> تنسيق
تنسيق = 
    عرف س = تنسيق
    تنسيقات ++ س 
    س  

:: (تنسيق) محدد... 
[+] انتقاء محددون =   
   عرف س = انتقاء( محددون )
	قواعد ++ س 
	س

:: (تنسيق)
[+] اطر_رئيسية معرف  =
	عرف اطار = اطار_رئيسي => معرف : معرف
	قواعد ++ اطار_رئيسي(اطار)
	اطار  

:: (محدد) سلسلة 
[+] معرف س = الحق( «#» ++ س ) 

:: (محدد) سلسلة 
[+] صنف  س = الحق( «.» ++ س ) 

:: (محدد) سلسلة 
[+] وسم س = الحق( س ) 

:: (محدد) سلسلة 
الحق محدد = قيمة ++= «>» ++ محدد 
 
:: (اطار_رئيسي)
[+] عند زياحة  = زياحة_الاطار_الرئيسي( زياحة )

:: (متن)
[+] قسم معرف =
    عرف _قسم = قسم(معرف)
    ابناء ++ قسم(_قسم)
    _قسم 
 
:: (قسم)
[+] صنف اسم = اصناف ++ اسم 

:: (قسم)
[+] نص س = ابناء ++ نص(س)`