export const تعاقب_الليل_والنهار=`احضر صفحة_الشبكة

دل بدء (معرف_منطقة_العرض) {
    صفحة() |> عرض_اولي (معرف_منطقة_العرض) 
}

دل صفحة {
    صفحة_الشبكة {
        راس {
           نسق {
               اختر(
                   عنصر             : [«متن»، «صفحة_الشبكة»]
                   هامش             : ٠
                   بطانة            : ٠
               )

               اختر(
                   عنصر             : «*»
                   تحجيم_الصندوق      : حدود_الصندوق
               )

               اختر(
                   عنصر             : «متن»
                   ارتفاع           : ١٠٠ع_ط  {- ع_ط : عرض مرأى مقطعي -}
                   لون_الخلفية      : بلا_قيمة
                   اظهار            : مرن
                   ضبط_المحتوى      : مركز
                   محاذاة_العناصر   : مركز 
               )

               اختر(
                   عنصر             : «#سماء»
                   عرض              : ١١م_ج {- م_ج : مقياس الجذر -}
                   اظهار            : مرن
                   ضبط_المحتوى      : بداية
                   فجوة             : ٣م_ج
                   حدود             : (٠,١م_ج ، بارز)
                   بطانة            : ٠,٣م_ج
                   قطر_الحدود       : ٢م_ج
                   لون_الخلفية      : سماوي_فاتح
               )
                اختر(
                   عنصر                            : «#حالة_اليوم»
                   _آبل_قدرة_اختيار_النص           : بلا_قيمة
                   _مايكروسوفت_قدرة_اختيار_النص    : بلا_قيمة
                   قدرة_اختيار_النص                : بلا_قيمة
                   موضع                            : مطلق
                   اظهار                           : مرن  
                   ضبط_المحتوى                     : مسافة_بين
                   هامش                            : ٠,٨م_ج
                   عرض                             : ٩م_ج 
                )      

                اختر(
                   عنصر            : «#ليل»
                   لون             : سماوي_فاتح
                )

                اختر(
                   عنصر            : «.مركز»
                   ضبط_المحتوى     : مركز
                   محاذاة_العناصر  : مركز
                )

                اختر(
                   عنصر            : «.دائرة»
                   عرض             : ٣م_ج
                   ارتفاع          : ٣م_ج
                   قطر_الحدود      : ٣م_ج
                )

                اختر(
                   عنصر            : «#دائرة_خارجية»
                   فائض            : مخفي
                   لون_الخلفية     : اصفر
                   عتامة           : ٥٨٪
                )

                اختر(
                   عنصر            : «#دائرة_داخلية»
                   عرض             : ٠
                   ارتفاع          : ٠
                   هامش_ايمن       : -٠,٧م_ج
                   هامش_سفلي       : -٠,٤م_ج
                   لون_الخلفية     : اسود
                )

                اختر(
                   عنصر            : «#سماء»
                   تحريك           : (ضوء، ٧ث ، لا_نهاية)
                )

                اختر(
                   عنصر            : «#سماء > #دائرة_خارجية»
                   تحريك           : (غروب_الشمس، ٧ث ، لا_نهاية)
                )
                    
                اختر(
                   عنصر            : «#سماء > #حالة_اليوم > #ليل»
                   تحريك           : (ليل، ٧ث ، لا_نهاية)
                )

                اختر(
                   عنصر            : «#سماء >  #دائرة_خارجية> #دائرة_داخلية»
                   تحريك           : (بزوغ_القمر ، ٧ث ، لا_نهاية)
                )

                اطارات_رئيسية («ليل») {
                   عند(٠٪     ، ( لون: سماوي_فاتح ) )
                   عند(٥٠٪    ، ( لون: ابيض       ) )
                   عند(١٠٠٪   ، ( لون: سماوي_فاتح ) )
                }

                اطارات_رئيسية («ضوء») {
                   عند(٠٪     ، ( لون_الخلفية: سماوي_فاتح ) )
                   عند(١٠٪    ، ( لون_الخلفية: سماوي_فاتح ) )
                   عند(٣٠٪    ، ( لون_الخلفية: اسود       ) )
                   عند(٥٠٪    ، ( لون_الخلفية: اسود       ) )
                   عند(٦٠٪    ، ( لون_الخلفية: اسود       ) )
                   عند(٧٠٪    ، ( لون_الخلفية: سماوي_فاتح ) )
                   عند(١٠٠٪   ، ( لون_الخلفية: سماوي_فاتح ) )
                }

                اطارات_رئيسية («بزوغ_القمر») {
                   عند(٠٪     ، [ (ارتفاع        : ٠          )
                                  (عرض           : ٠          )
                                  (لون_الخلفية   : سماوي_فاتح ) ])

                   عند(٥٠٪    ، [ (ارتفاع        : ٣م_ج       )
                                  (عرض           : ٣م_ج       )
                                  (لون_الخلفية   : اسود       ) ])

                   عند(١٠٠٪   ، [ (ارتفاع        : ٠          )
                                  (عرض           : ٠          )
                                  (لون_الخلفية   : سماوي_فاتح ) ])
                }


                اطارات_رئيسية («غروب_الشمس») {
                   عند(٠٪     ، ( تحول        : ازاحة_س(٠٪)     ) )
                   عند(١٠٪    ، ( لون_الخلفية : اصفر            ) )
                   عند(٢٠٪    ، ( لون_الخلفية : برتقالي         ) )
                   عند(٣٠٪    ، (لون_الخلفية  : اصفر            ) )
                   عند(٥٠٪    ، ( تحول        : ازاحة_س(-٢٣٥٪)  ) )
                   عند(٦٠٪    ، ( لون_الخلفية : اصفر            ) )
                   عند(٧٠٪    ، ( لون_الخلفية : برتقالي         ) )
                   عند(٨٠٪    ، ( لون_الخلفية : اصفر            ) )
                   عند(١٠٠٪   ، ( تحول        : ازاحة_س(٠٪)     ) )
                }

           } 
        }
        متن {
            قسم {
              قسم(«سماء»)  {
                قسم(«حالة_اليوم») {
                    قسم(«ليل») {«مساء الخير»}
                    قسم(«نهار») {«صباح الخير»}
                }
                قسم(«دائرة_خارجية»، صنف: «دائرة مركز») {
                    قسم(«دائرة_داخلية»، صنف: «دائرة»)
                }                    
              }
            }
        }
    }
}`